Having a similar issue. My configuration:

```hcl
resource "cloudflare_bot_management" "main" {
  zone_id            = var.cloudflare_zone_id
  ai_bots_protection = "block"
  crawler_protection = "enabled"
  enable_js          = true
  fight_mode         = true

  lifecycle {
    ignore_changes = [
      auto_update_model,
      optimize_wordpress,
      sbfm_definitely_automated,
      sbfm_likely_automated,
      sbfm_static_resource_protection,
      sbfm_verified_bots,
      stale_zone_configuration,
      suppress_session_score,
      using_latest_model,
    ]
  }
}

```

I'm getting resource update on each apply:

```
  # module.cloudflare.cloudflare_bot_management.main will be updated in-place
  ~ resource "cloudflare_bot_management" "main" {
      + auto_update_model               = (known after apply)
        id                              = "1629104c62b90a294f2ddb236c0fba9b"
      + optimize_wordpress              = (known after apply)
      + sbfm_definitely_automated       = (known after apply)
      + sbfm_likely_automated           = (known after apply)
      + sbfm_static_resource_protection = (known after apply)
      + sbfm_verified_bots              = (known after apply)
      + stale_zone_configuration        = (known after apply)
      + suppress_session_score          = false
        # (6 unchanged attributes hidden)
    }

```

Any chance this can be fixed soon?